//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
//int fun()
//{
//	static int f = 1;
//	return ++f;
//}
//
//
//int main()
//{
//	//int a = 10;                     //&& 是从左向右计算
//	//int b = 0;
//	//int c = 0;
//	//int d = c++ && a++ && ++b ;
//
//	//printf("%d %d %d %d", a, b, c, d);
//
//
//	int ans = fun() - fun() * fun();
//
//	printf("%d\n", ans);
//
//	return 0;
//}

//int main()
//{
//	//sizeof()是操作符，strlen()是函数
//	return 0;
//


//int main()
//{
//	//整形提升
//	char a = 3;
//	char b = 127;
//	char c = a + b;
//
//	printf("%d\n", c);
//
//	//a 00000011
//	//b 01111111
//	//整形提升后
//	//a 00000000000000000000000000000011
//	//b 00000000000000000000000001111111
//	//c 00000000000000000000000010000010
//	//c 补码：11111111111111111111111110000010
//	//c 反码：11111111111111111111111110000001
//	//c 原码：10000000000000000000000001111110
//	//c就是-126
//
//}

